STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval.c
#ifdef HAL_UART_MODULE_ENABLED
/**
  * @brief  Initialize COM port.
  * @param  COM: Specifies the COM port to be configured.
  *   This parameter can be one of following parameters:
  *     @arg COM1
  * @param  huart: pointer to a UART_HandleTypeDef structure that
  *   contains the configuration information for the specified UART peripheral.
  * @retval None
  */
void BSP_COM_Init(COM_TypeDef COM, UART_HandleTypeDef* huart)
{
  GPIO_InitTypeDef gpioinitstruct = {0};

  /* Enable GPIO clock */
  COMx_TX_GPIO_CLK_ENABLE(COM);
  COMx_RX_GPIO_CLK_ENABLE(COM);

  /* Enable USART clock */
  COMx_CLK_ENABLE(COM);

  /* IOSV bit MUST be set to access GPIO port G[2:15] */
  __HAL_RCC_PWR_CLK_ENABLE();
  HAL_PWREx_EnableVddIO2();

  /* Configure USART Tx as alternate function push-pull */
  gpioinitstruct.Pin = COM_TX_PIN[COM];
  gpioinitstruct.Mode = GPIO_MODE_AF_PP;
  gpioinitstruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  gpioinitstruct.Pull = GPIO_PULLUP;
  gpioinitstruct.Alternate = COM_TX_AF[COM];
  HAL_GPIO_Init(COM_TX_PORT[COM], &gpioinitstruct);

  /* Configure USART Rx as alternate function push-pull */
  gpioinitstruct.Pin = COM_RX_PIN[COM];
  gpioinitstruct.Alternate = COM_RX_AF[COM];
  HAL_GPIO_Init(COM_RX_PORT[COM], &gpioinitstruct);

  /* USART configuration */
  huart->Instance = COM_USART[COM];
  HAL_UART_Init(huart);
}

/**
  * @brief  DeInitialize COM port.
  * @param  COM: Specifies the COM port to be deinitialized.
  *   This parameter can be one of following parameters:
  *     @arg COM1
  * @param  huart: pointer to a UART_HandleTypeDef structure that
  *   contains the configuration information for the specified UART peripheral.
  * @retval None
  */
void BSP_COM_DeInit(COM_TypeDef COM, UART_HandleTypeDef* huart)
{
  /* USART configuration */
  huart->Instance = COM_USART[COM];
  HAL_UART_DeInit(huart);
}
#endif /* HAL_UART_MODULE_ENABLED */


#ifdef HAL_ADC_MODULE_ENABLED
/**
  * @brief  Init the potentioneter RV2 measurement thanks to ADC.
  * Limitations : the potentiometer are exclusive with MFX, Audio codex,
  * OctoSPIP1, Debugging connector and MC operation. And they are mutually exclusive.
  * Please deinit all these components before usage.
  * @retval BSP_POTENTIOMETER_OK if no error
  */
uint32_t BSP_POTENTIOMETER_Init(void)
{
  GPIO_InitTypeDef          GPIO_InitStruct;
  ADC_ChannelConfTypeDef    sConfig;

  /* ADC clock enable */
  ADCx_CLK_ENABLE();
  /* ADC an GPIO Periph clock enable */
  ADCx_CHANNEL_GPIO_CLK_ENABLE();
  /* ADC Periph interface clock configuration */
  __HAL_RCC_ADC_CONFIG(RCC_ADCCLKSOURCE_SYSCLK);

  /* ADC Channel GPIO pin configuration */
  GPIO_InitStruct.Pin = ADCx_CHANNEL_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
  GPIO_InitStruct.Pull = GPIO_NOPULL;

  HAL_GPIO_Init(ADCx_CHANNEL_GPIO_PORT, &GPIO_InitStruct);

  /*##-1- Configure the ADC peripheral #######################################*/
  hEvalADC.Instance          = ADCx;

  if (HAL_ADC_DeInit(&hEvalADC)) return BSP_POTENTIOMETER_ERROR;

  hEvalADC.Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV2;      /* Synchronous clock mode, input ADC clock not divided */
  hEvalADC.Init.Resolution            = ADC_RESOLUTION_12B;            /* 12-bit resolution for converted data */
  hEvalADC.Init.DataAlign             = ADC_DATAALIGN_RIGHT;           /* Right-alignment for converted data */
  hEvalADC.Init.ScanConvMode          = DISABLE;                       /* Sequencer disabled (ADC conversion on only 1 channel: channel set on rank 1) */
  hEvalADC.Init.EOCSelection          = ADC_EOC_SINGLE_CONV;           /* EOC flag picked-up to indicate conversion end */
  hEvalADC.Init.LowPowerAutoWait      = DISABLE;                       /* Auto-delayed conversion feature disabled */
  hEvalADC.Init.ContinuousConvMode    = DISABLE;                       /* Continuous mode disabled to have only 1 conversion at each conversion trig */
  hEvalADC.Init.NbrOfConversion       = 1;                             /* Parameter discarded because sequencer is disabled */
  hEvalADC.Init.DiscontinuousConvMode = DISABLE;                       /* Parameter discarded because sequencer is disabled */
  hEvalADC.Init.NbrOfDiscConversion   = 1;                             /* Parameter discarded because sequencer is disabled */
  hEvalADC.Init.ExternalTrigConv      = ADC_SOFTWARE_START;            /* Software start to trig the 1st conversion manually, without external event */
  hEvalADC.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE; /* Parameter discarded because software trigger chosen */
  hEvalADC.Init.DMAContinuousRequests = DISABLE;                       /* DMA one-shot mode selected (not applied to this example) */
  hEvalADC.Init.Overrun               = ADC_OVR_DATA_OVERWRITTEN;      /* DR register is overwritten with the last conversion result in case of overrun */
  hEvalADC.Init.OversamplingMode      = DISABLE;                       /* No oversampling */

  if (HAL_ADC_Init(&hEvalADC) != HAL_OK) return BSP_POTENTIOMETER_ERROR;

  /*##-2- Configure ADC regular channel ######################################*/
  sConfig.Channel      = ADCx_CHANNEL;                /* Sampled channel number */
  sConfig.Rank         = ADC_REGULAR_RANK_1;          /* Rank of sampled channel number ADCx_CHANNEL */
  sConfig.SamplingTime = ADC_SAMPLETIME_6CYCLES_5;    /* Sampling time (number of clock cycles unit) */
  sConfig.SingleDiff   = ADC_SINGLE_ENDED;            /* Single-ended input channel */
  sConfig.OffsetNumber = ADC_OFFSET_NONE;             /* No offset subtraction */
  sConfig.Offset = 0;                                 /* Parameter discarded because offset correction is disabled */


  if (HAL_ADC_ConfigChannel(&hEvalADC, &sConfig) != HAL_OK) return BSP_POTENTIOMETER_ERROR;

  /* Run the ADC calibration in single-ended mode */
  if (HAL_ADCEx_Calibration_Start(&hEvalADC, ADC_SINGLE_ENDED)) return BSP_POTENTIOMETER_ERROR;


  return BSP_POTENTIOMETER_OK;
}

/**
  * @brief  DeInitialize the potentioneter RV2 measurement thanks to ADC.
  * Limitations : the potentiometer are exclusive with MFX, Audio codex,
  * OctoSPIP1, Debugging connector and MC operation. And they are mutually exclusive.
  * Please deinit all these components before usage.
  * @retval BSP_POTENTIOMETER_OK if no error
  */
uint32_t BSP_POTENTIOMETER_DeInit(void)
{
  if (HAL_ADC_DeInit(&hEvalADC) != HAL_OK) return BSP_POTENTIOMETER_ERROR;

  return BSP_POTENTIOMETER_OK;
}

/**
  * @brief  Get the potentioneter RV2 measurement thanks to ADC.
  * Limitations : the potentiometer are exclusive with MFX, Audio codex,
  * OctoSPIP1, Debugging connector and MC operation. And they are mutually exclusive.
  * Please deinit all these components before usage.
  * @retval value if no error else 0xFFFFFFFF
  */
uint32_t BSP_POTENTIOMETER_GetLevel(void)
{
  /*##-3- Start the conversion process #######################################*/
  if (HAL_ADC_Start(&hEvalADC) != HAL_OK) return BSP_POTENTIOMETER_ERROR;

  if(HAL_ADC_PollForConversion(&hEvalADC, ADCx_POLL_TIMEOUT)== HAL_OK)
  {
    return (HAL_ADC_GetValue(&hEvalADC));
  }
  else
  {
    return  0xFFFFFFFF;
  }
}
#endif /* HAL_ADC_MODULE_ENABLED */

/**
  * @}
  */

